
## Plan Result (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/32205)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-01-31T18:09:48Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:b1aoz7w8yj/" -> (known after apply)
      ~ id            = "ikiosf" -> (known after apply)
      ~ invoke_url    = "https://b1aoz7w8yj.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1706724536993" -> "1706724979301"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "ikiosf" -> (known after apply)
        id                    = "ags-b1aoz7w8yj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"d0311ee8-3969-4bf1-b70b-347bb188d26d","JobName":"fxa-webhook-proxy_infrastructure_plan_prod","PRNumber":132,"Program":"tfcmt","SHA1":"261a0484620d3197e0b0902f4d0efbd6b3a3e2dc","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->